Revit 2026 API

# ClassificationEntry Class

---

Represents an entry in the classification table.

SystemObject Autodesk.Revit.DBKeyBasedTreeEntry Autodesk.Revit.DBClassificationEntry

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ClassificationEntry : KeyBasedTreeEntry
```
```vb
Public Class ClassificationEntry
	Inherits KeyBasedTreeEntry
```
```cpp
public ref class ClassificationEntry : public KeyBasedTreeEntry
```
```fsharp
type ClassificationEntry =
    class
        inherit KeyBasedTreeEntry
    end
```

The ClassificationEntry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ClassificationEntry | Constructs a ClassificationEntry object |

|  | Name | Description |
| --- | --- | --- |
|  | CategoryId | The id of the category associated with this entry. |
|  | Description | The description associated with this entry. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from KeyBasedTreeEntry) |
|  | Key | The key of this entry. (Inherited from KeyBasedTreeEntry) |
|  | Level | The entry level in the classification table. The expected range is between 1 and 5 inclusive. |
|  | ParentKey | The parent key of this entry. (Inherited from KeyBasedTreeEntry) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from KeyBasedTreeEntry) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetChildrenKeys | Gets a collection containing the keys of all children entry objects from this entry. (Inherited from KeyBasedTreeEntry) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | HasBadCategoryId | Checks if the category id is Revit BuiltInCategory id. |
|  | HasBadLevel | Checks if the level is an integer in range between 1 and 5 inclusive. |
|  | HasInvalidKey | Checks if the key matches the level and parent key. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace